{
  "news1": {
    "date": "June 6, 2019",
    "title": "Pence Says Mexico Tariffs Still Set for Monday as Talks Continue",
    "synopsis": "Vice President Mike Pence said the U.S. still plans to impose tariffs on Mexico next week over the flow of undocumented migrants from Central America, but talks between the two nations continue.",
    "newsUrl": "https://www.bloomberg.com/news/articles/2019-06-06/u-s-weighs-delaying-mexico-tariffs-as-time-for-deal-runs-short",
    "uid": "1234"
  },
  "news2": {
    "date": "May 29, 2019",
    "title": "Nancy Pelosi wants Trump 'in prison.' Not likely.",
    "synopsis": "(CNN)In a closed-door meeting with Democratic leaders on Wednesday, Nancy Pelosi sought to quell the rising calls for the impeachment of President Donald Trump by reportedly telling her colleagues, according to Politico: 'I don't want to see him impeached. I want to see him in prison.'",
    "newsUrl": "https://www.cnn.com/2019/06/06/politics/nancy-pelosi-trump-prison/index.html",
    "uid": "1234"
  },
  "news3": {
    "date": "February 21, 2019",
    "title": "Trump Honors D-Day Sacrifices, With Some Legacies Unspoken",
    "synopsis": "COLLEVILLE-SUR-MER, France — Standing on a sun-drenched bluff above the Normandy beaches, where 10,000 soldiers sacrificed themselves to a savage fusillade of gunfire and opened the way for Europe’s liberation in 1944, President Trump declared on Thursday, “We are gathered here on freedom’s altar.”",
    "newsUrl": "https://www.nytimes.com/2019/06/06/world/europe/trump-d-day-speech.html",
    "uid": "1234"
  },
  "news4": {
    "date": "February 21, 2019",
    "title": "At 98, D-Day Veteran Medic Returns To Normandy To Remember A Generation's Sacrifice",
    "synopsis": "For much of his life, Ray Lambert wouldn't talk about World War II. But then the 98-year-old veteran army medic began returning to Normandy, where, on June 6, 1944, he led a unit of medics as a 24-year-old staff sergeant in the allied invasion of western Europe.",
    "newsUrl": "https://www.npr.org/2019/06/06/730126155/at-98-d-day-veteran-medic-returns-to-normandy-to-remember-a-generations-sacrific",
    "uid": "1234"
  }
}